{"format": "keras", "nodes": [{"name": "densenet121_input", "id": "densenet121_input", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "densenet121", "id": "densenet121", "class_name": "Functional", "output_shape": [null, 7, 7, 1024], "num_parameters": 7037504}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1024], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 131200}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 128], "num_parameters": 0}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 774}], "edges": [["densenet121_input", "densenet121"], ["densenet121", "global_average_pooling2d"], ["global_average_pooling2d", "dense"], ["dense", "dropout"], ["dropout", "dense_1"]]}